#include "headers/menu.h"

/* TODO :

--- Алгоритмы операций поиска, вставки и удаления реализуются в
итеративной форме.
--- Вывод на экран последовательности ключей при обходе узлов де-
рева по схеме Lt → t → Rt.
--- Дополнительная операция: вывод на экран горизонтального изоб-
ражения дерева (размер ≤ 8) с симметричным позиционированием узлов
относительно родителей. Трудоёмкость операции – O (n).

  teenspirit list:
    конструктор !done
    конструктор копирования ☑
    деструктор !done
    insert ☑!done
    remove !done
    printTree ☑ (изменить если будет время) //fixme
  badblues list:
    size ☑
    clear ☑
    isEmpty ☑
    get ☑
    set ☑
    printKeys ☑
    итероторы 
    меню ☑
    меню для итераторов ☑
    предусмотреть запрет на дупликацию ключей ☑
    CountNodes 
 */

int main() {
  MainMenu();
  return 0;
}